Carter-Liu-Roy/Ti5_TA8T2_Prj/RA8T2_MultiCore_Solution_CPU0/ra_gen/hal_data.c
                                   .channel_control_a_bits.digital_filter_id = RA_NOT_DEFINED,
                                   .channel_control_a_bits.offset_table_id = RA_NOT_DEFINED,
                                   .channel_control_a_bits.gain_table_id = RA_NOT_DEFINED,

                                   .channel_control_b_bits.addition_average_mode = RA_NOT_DEFINED,
                                   .channel_control_b_bits.addition_average_count = RA_NOT_DEFINED,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = RA_NOT_DEFINED,
                                   .channel_control_c_bits.channel_data_format = RA_NOT_DEFINED,
                                   .channel_control_c_bits.data_is_unsigned = false,
                               };
                               #endif

                               #if RA_NOT_DEFINED // Define Virtual Channel 35 if it's assigned to a scan group.
                               const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_35_cfg =
                               {
                                   .channel_id             = ADC_B_VIRTUAL_CHANNEL_35,

                                   .channel_cfg_bits.group           = RA_NOT_DEFINED,
                                   .channel_cfg_bits.channel         = RA_NOT_DEFINED,
                                   .channel_cfg_bits.differential    = 0,
                                   .channel_cfg_bits.sample_table_id = RA_NOT_DEFINED,

                                   .channel_control_a_bits.digital_filter_id = RA_NOT_DEFINED,
                                   .channel_control_a_bits.offset_table_id = RA_NOT_DEFINED,
                                   .channel_control_a_bits.gain_table_id = RA_NOT_DEFINED,

                                   .channel_control_b_bits.addition_average_mode = RA_NOT_DEFINED,
                                   .channel_control_b_bits.addition_average_count = RA_NOT_DEFINED,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = RA_NOT_DEFINED,
                                   .channel_control_c_bits.channel_data_format = RA_NOT_DEFINED,
                                   .channel_control_c_bits.data_is_unsigned = false,
                               };
                               #endif

                               #if RA_NOT_DEFINED // Define Virtual Channel 36 if it's assigned to a scan group.
                               const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_36_cfg =
                               {
                                   .channel_id             = ADC_B_VIRTUAL_CHANNEL_36,

                                   .channel_cfg_bits.group           = RA_NOT_DEFINED,
                                   .channel_cfg_bits.channel         = RA_NOT_DEFINED,
                                   .channel_cfg_bits.differential    = 0,
                                   .channel_cfg_bits.sample_table_id = RA_NOT_DEFINED,

                                   .channel_control_a_bits.digital_filter_id = RA_NOT_DEFINED,
                                   .channel_control_a_bits.offset_table_id = RA_NOT_DEFINED,
                                   .channel_control_a_bits.gain_table_id = RA_NOT_DEFINED,

                                   .channel_control_b_bits.addition_average_mode = RA_NOT_DEFINED,
                                   .channel_control_b_bits.addition_average_count = RA_NOT_DEFINED,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = RA_NOT_DEFINED,
                                   .channel_control_c_bits.channel_data_format = RA_NOT_DEFINED,
                                   .channel_control_c_bits.data_is_unsigned = false,
                               };
                               #endif
#if (((1) == 1)||((1) == 1)||((1) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||(RA_NOT_DEFINED == 1)||(RA_NOT_DEFINED == 1)||(RA_NOT_DEFINED == 1)||(RA_NOT_DEFINED == 1))
const adc_b_virtual_channel_cfg_t *const g_adc0_group_0_virtual_channels[] = {
                                  #if ((1) == 1)
                                      &g_adc0_virtual_channel_0_cfg,
                                  #endif

                                  #if ((1) == 1)
                                      &g_adc0_virtual_channel_1_cfg,
                                  #endif

                                  #if ((1) == 1)
                                      &g_adc0_virtual_channel_2_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_3_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_4_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_5_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_6_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_7_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_8_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_9_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_10_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_11_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_12_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_13_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_14_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_15_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_16_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_17_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_18_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_19_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_20_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_21_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_22_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_23_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_24_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_25_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_26_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_27_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_28_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_29_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_30_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_31_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_32_cfg,
                                  #endif

